#
# Casks
#

# Productivity applications
cask 'google-chrome'
cask 'notion-calendar'
cask '1password'
cask 'spotify'

# Developer applications
cask 'warp'
cask 'visual-studio-code'
cask 'zed'

#
# Packages
#

# Foundation
brew 'git'
brew 'gh'
brew 'awscli'
brew 'jq'

# Kubernetes
brew 'k9s'
brew 'kubernetes-cli'
brew 'helm'

# Terraform
brew 'terraform'
brew 'terragrunt'
